<template>
<div class="content" id="about">

    <div class="row">
        <div class="col-lg-6 text-center my-4 px-4">
            <h2>هدف ما</h2>
            <hr/>
            <p class="text-justify">هدف ما از این کامیونیتی به وجود آوردن یک محیط ساختار یافته هست که بتونید در این محیط یاد بگیرید و در فعالیت ها و تیم های مختلف
        شرکت کنید و با آدمای مختلف در حوزه های مختلف آشنا بشید و اگر سوال یا راهنمایی هم خواستید ازشون کمک
        بگیرید. منظور از فعالیت، هر فعالیتی تو هر حوزه ای هست. از یه تحقیق گروهی در علوم انسانی و پایه گرفته تا
            یک پروژه ی فیلم سازی یا برنامه نویسی</p>
            <p style="text-align:center"><a class="btn btn-info" href="#join-us" role="button">عضویت</a></p>
        </div>
        <div class="col-lg-6 text-center my-4 px-4">
            <h3>در حال یادگیری هستید؟</h3>
            <hr/>
            <p class="text-justify">بعد از وارد شدن به گروه حوزه هایی رو برای یادگیری خودتون انتخاب می کنید و هر هفته از فعالیتی که برای یادگیری اون
        حوزه انجام دادید به بقیه اعضای تیم گزارش می دید. گزارش جزئیات خاصی نیاز نداره و میتونه در حد ۴-۵ جمله باشه. مثلا
        این که یه آموزش آنلاین درباره اون حوزه شروع کردید یا یک کتاب دربارش خوندید. البته گزارش دقیق تر برای انتقال
        تجربه یادگیریتون به دیگران بهتر هست</p>
        </div>
        <div class="col-lg-6 text-center my-4 px-4">
            <h3>تمایل دارید به یادگیری دیگران کمک کنید؟</h3>
            <hr/>
            <p class="text-justify">اطراف ما پر از انسان های مستعدی هست که نیاز به مسیر یادگیری دارند. با تکیه بر دانش و مهارت خود به این افراد در کامیونیتی کمک کنید و همچنین نیروهای حرفه ای مورد نیاز خود را با صرف زمان اندک پرورش دهید.</p>
        </div>
        <div class="col-lg-6 text-center my-4 px-4">
            <h3>دنبال هم تیمی هستید؟</h3>
            <hr/>
            <p class="text-justify">وقتی برای انجام فعالیت های تیمی واقعی آماده شدید، اگر توی کاری به هم تیمی هایی از حوزه خودتون یا حوزه های دیگه نیاز داشتید از طریق این گروه سابقه گزارش ها و فعالیتشون رو ببینید و با شناخت نسبی که پیدا کردید بهشون پیشنهاد بدید و نهایتا در قالب تیم با هم کار کنید. سعی کنید گزارش های جذاب بنویسید و فعالیت کنید تا دیگران هم شما رو به عنوان هم تیمی انتخاب کنند</p>
        </div>
    </div>
<hr style="margin: 30px 0px;"/>
<div id="join-us">
    <h1 class="header">چطوری عضو شیم؟</h1>
    <p>اگر دوست دارید با آدمای مختلف آشنا بشید و کار تیمی کنید و در یک محیط حرفه ای یاد بگیرید، خوشحال میشیم در جمع ما باشید :)</p>
    <router-link :to="{name: 'register'}" tag="h5"><a>عضویت و دریافت لینک گروه ها</a></router-link>
    </div>
</div>
</template>

<script>
  export default {
  }
</script>

<style scoped>
h5 {
    text-align: center;
    color: #2900a8;
    padding-top: 10px
}

</style>
